luckyCharm1123/STM32_LED/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body 主程序主体
  * @details        : This file contains the main application code for the STM32 LED
  *                  blinking project with USART2 serial communication.
  *                  本文件包含STM32 LED闪烁和串口通信项目的主应用程序代码。
  *                  USART2 configured on PA2(TX) and PA3(RX) pins at 115200 baud.
  *                  USART2配置在PA2(TX)和PA3(RX)引脚，波特率115200。
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  * @par Project Context 项目背景
  * - MCU: STM32F103xB (ARM Cortex-M3)
  * - IDE: STM32CubeIDE / CMake
  * - Purpose: LED blinking + USART2 serial communication
  * - 目的：LED闪烁 + USART2串口通信
  * - USART2: 115200 8N1, TX=PA2, RX=PA3
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal_def.h"
#include <stdio.h>  // 用于printf重定向，实现标准输出到串口
#include <string.h> // 用于字符串操作，如strlen、strncmp、memset等
#include <stdlib.h> // 用于atoi函数，字符串转整数
#include <inttypes.h> // 用于PRIu32等格式化宏
#include "sht30_soft.h"  // SHT30温湿度传感器驱动（软件I2C版本）
#include "radar.h"  // 毫米波雷达驱动
#include "lora.h"  // LoRa通信模块驱动

/* USER CODE BEGIN PV */
/* 用户代码开始：私有变量 */

UART_HandleTypeDef huart1;  // USART1句柄，用于调试输出（PA9/PA10，115200）
UART_HandleTypeDef huart2;  // USART2句柄，用于LoRa通信（PA2/PA3，9600/115200）
UART_HandleTypeDef huart3;  // USART3句柄，用于毫米波雷达通信（PB10/PB11，115200）
DMA_HandleTypeDef hdma_usart3_rx;  // USART3接收DMA句柄

/* 动态WiFi配置变量 */
char g_device_code[9];  // 全局设备码，8位十六进制 + 结束符
static char g_lora_mac[5] = {0};      // 保存配置后的MAC(4字符)
static char g_lora_channel[3] = {0};  // 保存配置后的CHANNEL(2字符)
static uint8_t g_lora_configured = 0;
static uint8_t g_getdata_miss_count = 0; // 连续未收到getData的次数

/* 状态发送机结构体 */
typedef struct
{
  uint8_t  send_state;       /* 发送状态 */
  uint32_t last_send_time;   /* 上次发送时间(ms) */
  uint32_t interval_ms;      /* 当前发送间隔(ms) */
  uint8_t  fast_remaining;   /* 快速模式剩余次数 */
  uint8_t  initialized;      /* 是否已初始化 */
} StateSender_t;

static StateSender_t g_state_sender = {0};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);  // 系统时钟配置函数声明
static void MX_GPIO_Init(void); // GPIO初始化函数声明（静态函数，仅在本文件内可见）
static void MX_USART1_UART_Init(void); // USART1初始化函数声明（调试串口）
static void MX_USART2_UART_Init(void); // USART2初始化函数声明（LoRa串口）
static void MX_USART3_UART_Init(void); // USART3初始化函数声明（雷达串口）

/* USER CODE BEGIN PFP */
/* 用户代码开始：私有函数原型 */
void DEBUG_SendString(const char *str);    // USART1调试串口发送函数原型
void Get_STM32_UID(char *uid_str);         // 获取STM32芯片唯一ID
void Generate_Device_Code(char *device_code);  // 生成8位设备码
uint8_t Process_Sensor_Status(uint8_t *last_combined_state);  // 处理传感器状态并返回综合状态
void StateSender_Init(void);               // 初始化状态发送机
void StateSender_Update(void);             // 状态发送机更新
int StateSender_SendFast(void);            // 快速发送函数
int StateSender_SendNormal(void);          // 正常发送函数
void StateSender_ResetFastMode(void);      // 进入/重置快速发送模式
void LORA_ReinitAndConfig(void);           // 重新初始化LoRa并配置MAC/CHANNEL
Radar_TargetStatus_t StateSender_GetRadarStatus(void);  // 获取毫米波雷达状态
uint32_t StateSender_GetRadarPowerSum(void);            // 获取P值总值
uint32_t StateSender_GetRadarRangeSum(void);            // 获取R值总值
uint16_t StateSender_GetRadarValidCount(void);          // 获取有效次数
int StateSender_GetTempHumi(float *temp, float *humi);  // 获取温湿度
static void StrToUpper(char *str);         // 字符串转大写(就地)
/**
  * @brief USART1发送调试信息
  * @param str: 要发送的调试字符串，以'\0'结尾
  * @retval None
  * @details USART1专用调试串口，配置在PA9(TX)/PA10(RX)
  *          波特率115200，用于输出系统调试信息
  */
void DEBUG_SendString(const char *str)
{
  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

/**
  * @brief 字符串转大写(就地)
  * @param str: 待转换字符串
  * @retval None
  */
static void StrToUpper(char *str)
{
  if(str == NULL)
  {
    return;
  }
  while(*str)
  {
    if(*str >= 'a' && *str <= 'z')
    {
      *str = (char)(*str - ('a' - 'A'));
    }
    str++;
  }
}

int main(void)
{
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();              // 初始化GPIO
  MX_USART1_UART_Init();       // 初始化USART1（调试串口）
  MX_USART2_UART_Init();       // 初始化USART2（LoRa串口）
  MX_USART3_UART_Init();       // 初始化USART3（雷达串口）
  SHT30_Soft_Init();  // 初始化软件I2C
  HAL_Delay(10);

  /* 初始化雷达模块 */
  if(RADAR_Init() != 0)
  {
    DEBUG_SendString("[ERR] Radar init failed\r\n");
  }

  /* 初始化LoRa模块（USART2，波特率9600） */
  DEBUG_SendString("[LORA] Initializing...\r\n");
  DEBUG_SendString("[LORA] Step 1: Sending +++ command (waiting for 'Entry AT')...\r\n");

  /* 生成设备码（基于芯片唯一ID）- 必须在发送之前生成 */
  Generate_Device_Code(g_device_code);
  char device_msg[64];
  /* 拼接字符串 */
  snprintf(device_msg, sizeof(device_msg), "Device Code: %s\r\n", g_device_code);
  /* 发送到串口调试 */
  DEBUG_SendString(device_msg);

  if(LORA_Init(9600) != 0)
  {
    DEBUG_SendString("[ERR] LoRa init failed\r\n");
  }
  else
  {
    DEBUG_SendString("[LORA] LoRa initialized successfully\r\n");

    /* LoRa初始化成功后，发送设备ID "setting" + 设备码 */
    char device_id_data[32];
    snprintf(device_id_data, sizeof(device_id_data), "setting%s", g_device_code);

    if(LORA_SendFormattedData(device_id_data) == 0)
    {
      DEBUG_SendString("[LORA] Device ID sent successfully\r\n");
    }
    else
    {
      DEBUG_SendString("[LORA] Failed to send device ID\r\n");
    }
  }

  /* 打开继电器 */
  RELAY_On();
  DEBUG_SendString("[RELAY] Relay turned ON\r\n");

  DEBUG_SendString("[SYSTEM] Initialization Successful\r\n\r\n");

  /* 传感器状态输出计时变量 */
  static uint32_t last_sensor_output_time = 0;
  const uint32_t sensor_output_interval = 500;  // 500ms输出一次

  /* 雷达状态变量 */
  static uint8_t last_radar_has_person = 0;  // 上次雷达状态（0=无人，1=有人）

  while (1)
  {
    /* 处理雷达数据 */
    RADAR_Process();

    /* 检查LoRa是否接收到数据 */
    if(LORA_IsDataReady())
    {
      uint8_t lora_rx_data[256];
      uint16_t lora_rx_len = LORA_GetData(lora_rx_data, sizeof(lora_rx_data));

