luckyCharm1123/STM32_LED/Core/Src/main.c
      /* 重启UART接收中断，准备接收下一帧数据 */
      extern uint8_t lora_rx_byte;
      HAL_UART_Receive_IT(&huart2, &lora_rx_byte, 1);

      if(lora_rx_len > 0)
      {
        char debug_msg[512];

        /* 打印设备ID用于调试 */
        snprintf(debug_msg, sizeof(debug_msg),
                 "[LORA] My Device ID: %s\r\n", g_device_code);
        DEBUG_SendString(debug_msg);

        /* 按\r\n拆包处理 */
        char rx_str[257];
        uint16_t copy_len = (lora_rx_len < sizeof(rx_str) - 1) ? lora_rx_len : (sizeof(rx_str) - 1);
        memcpy(rx_str, lora_rx_data, copy_len);
        rx_str[copy_len] = '\0';

        char *saveptr = NULL;
        uint8_t getdata_handled = 0;
        char last_line[256] = {0};
        char *line = strtok_r(rx_str, "\r\n", &saveptr);
        while(line != NULL)
        {
          if(line[0] != '\0')
          {
            /* 跳过同一批次重复行 */
            if(strcmp(line, last_line) == 0)
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }
            strncpy(last_line, line, sizeof(last_line) - 1);
            last_line[sizeof(last_line) - 1] = '\0';

            /* 过滤常见无关回显 */
            if(strcmp(line, "getData") == 0 || strcmp(line, "OK") == 0 || strcmp(line, "Power on") == 0)
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }

            /* 长度不足设备ID的直接忽略 */
            if(strlen(line) < strlen(g_device_code))
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }

            /* 使用ASCII字符串格式解析函数 */
            char payload[256];
            int payload_len = LORA_ParseStringPacket(
                                (uint8_t *)line, strlen(line),
                                g_device_code, payload, sizeof(payload));

            if(payload_len > 0)
            {
              /* 成功提取到负载内容 */
              snprintf(debug_msg, sizeof(debug_msg),
                       "[LORA RX] Command received: %s\r\n", payload);
              DEBUG_SendString(debug_msg);

              /* 为命令比较生成大写副本，兼容RELAYOn/RELAYOff等混合大小写 */
              char payload_upper[256];
              strncpy(payload_upper, payload, sizeof(payload_upper) - 1);
              payload_upper[sizeof(payload_upper) - 1] = '\0';
              StrToUpper(payload_upper);

              /* 处理setting命令: settingMACCHANNEL */
              if(strncmp(payload_upper, "SETTING", 7) == 0)
              {
                /* 提取setting后面的参数 */
                char *params = &payload[7];  /* 跳过"setting" */
                uint16_t params_len = strlen(params);

                snprintf(debug_msg, sizeof(debug_msg),
                         "[LORA] Params length: %d, Params content: %s\r\n",
                         params_len, params);
                DEBUG_SendString(debug_msg);

                DEBUG_SendString("[LORA] Processing configuration command\r\n");

                /* 解析MAC和CHANNEL (格式: MAC4字符+CHANNEL2字符) */
                if(params_len >= 6)  /* 至少需要4字符MAC+2字符CHANNEL */
                {
                  /* 前面4个字符是MAC,后面2个字符是CHANNEL */
                  char mac[5];
                  char channel[3];

                  /* 提取MAC (4个字符) */
                  memcpy(mac, params, 4);
                  mac[4] = '\0';

                  /* 提取CHANNEL (2个字符) */
                  memcpy(channel, &params[4], 2);
                  channel[2] = '\0';

                  /* 打印解析结果 */
                  snprintf(debug_msg, sizeof(debug_msg),
                           "[LORA] MAC: %s, CHANNEL: %s\r\n", mac, channel);
                  DEBUG_SendString(debug_msg);

                  /* 调用LoRa MAC和CHANNEL配置函数 */
                  if(LORA_ConfigureMacAndChannel(mac, channel) == 0)
                  {
                    DEBUG_SendString("[LORA] MAC and CHANNEL configured successfully\r\n");

                    /* 保存MAC和CHANNEL，标记已配置 */
                    memcpy(g_lora_mac, mac, sizeof(g_lora_mac));
                    memcpy(g_lora_channel, channel, sizeof(g_lora_channel));
                    g_lora_configured = 1;
                    g_getdata_miss_count = 0;

                    /* 设备已获得MAC和CHANNEL，初始化状态发送机 */
                    StateSender_Init();

                    /* 配置成功后发送确认消息: ok+MAC+CHANNEL+设备码 (6a6a4a前缀由发送函数自动添加) */
                    char confirm_msg[32];
                    snprintf(confirm_msg, sizeof(confirm_msg), "ok%s%s%s", mac, channel, g_device_code);

                    if(LORA_SendFormattedData(confirm_msg) == 0)
                    {
                      DEBUG_SendString("[LORA] Configuration confirmation sent successfully\r\n");
                    }
                    else
                    {
                      DEBUG_SendString("[LORA] ERROR: Failed to send configuration confirmation\r\n");
                    }
                  }
                  else
                  {
                    DEBUG_SendString("[LORA] ERROR: Failed to configure MAC and CHANNEL\r\n");
                  }
                }
                else
                {
                  DEBUG_SendString("[LORA] ERROR: Invalid params format (need MAC+CHANNEL)\r\n");
                }
              }
              /* 处理继电器命令 */
              else if(strcmp(payload_upper, "ON") == 0 ||
                      strcmp(payload_upper, "RELAYON") == 0)
              {
                RELAY_On();
                DEBUG_SendString("[RELAY] Turned ON via LoRa\r\n");
              }
              else if(strcmp(payload_upper, "GETDATA") == 0)
              {
                /* 同一批次只处理一次getData */
                if(!getdata_handled)
                {
                  g_getdata_miss_count = 0;
                  DEBUG_SendString("[LORA] getData received, miss counter reset\r\n");
                  getdata_handled = 1;
                }
              }
              else if(strcmp(payload_upper, "OFF") == 0 ||
                      strcmp(payload_upper, "RELAYOFF") == 0)
              {
                RELAY_Off();
                DEBUG_SendString("[RELAY] Turned OFF via LoRa\r\n");
              }
              else
              {
                DEBUG_SendString("[LORA] Unknown command\r\n");
              }
            }
            else
            {
              /* 解析失败或不是发给本设备的数据 */
              DEBUG_SendString("[LORA RX] Packet ignored (invalid or not for this device)\r\n");
            }
          }

          line = strtok_r(NULL, "\r\n", &saveptr);
        }
      }
    }

    /* 每500ms处理并输出一次传感器状态 */
    if(HAL_GetTick() - last_sensor_output_time >= sensor_output_interval)
    {
      Process_Sensor_Status(&last_radar_has_person);
      last_sensor_output_time = HAL_GetTick();
    }

