luckyCharm1123/STM32_LED/Core/Src/main.c
  // 格式化为字符串：XXXXXXXX-XXXXXXXX-XXXXXXXX
  sprintf(uid_str, "%08" PRIX32 "%08" PRIX32 "%08" PRIX32, uid_0, uid_1, uid_2);
}

/**
  * @brief 处理传感器状态并输出
  * @param last_combined_state: 上次雷达状态的指针（用于检测状态切换）
  * @retval 当前雷达状态（0=无人，1=有人）
  * @details 处理毫米波雷达状态，输出调试信息
  */
uint8_t Process_Sensor_Status(uint8_t *last_combined_state)
{
  /* 获取雷达目标状态 */
  Radar_TargetStatus_t target_status = RADAR_GetTargetStatus();

  /* 判断雷达状态：DETECTED、WITH_INFO、BUFFERING 都算有人 */
  uint8_t radar_has_person = 0;
  if(target_status == RADAR_TARGET_DETECTED ||
     target_status == RADAR_TARGET_WITH_INFO ||
     target_status == RADAR_TARGET_BUFFERING)
  {
    radar_has_person = 1;
  }

  /* 检测雷达状态从无人切换到有人 */
  if(radar_has_person == 1 && *last_combined_state == 0)
  {
    /* 确保继电器打开 */
    RELAY_On();

    /* 有人触发：重置为快速发送模式（10次，5s） */
    StateSender_ResetFastMode();

    DEBUG_SendString("[SENSOR] Person detected\r\n");
  }
  else if(radar_has_person == 0 && *last_combined_state == 1)
  {
    DEBUG_SendString("[SENSOR] No person detected\r\n");
  }

  /* 更新上次的雷达状态 */
  *last_combined_state = radar_has_person;

  return radar_has_person;
}

/**
  * @brief 初始化状态发送机
  * @retval None
  * @details 初始化发送状态和时间戳
  */
void StateSender_Init(void)
{
  g_state_sender.send_state = 0;
  g_state_sender.last_send_time = HAL_GetTick();
  g_state_sender.interval_ms = 5000;  /* 快速发送间隔 5s */
  g_state_sender.fast_remaining = 10; /* 快速发送次数 */
  g_state_sender.initialized = 1;
  DEBUG_SendString("[STATE] State sender initialized (fast mode)\r\n");
}

/**
  * @brief 进入/重置快速发送模式
  * @retval None
  */
void StateSender_ResetFastMode(void)
{
  g_state_sender.interval_ms = 5000;
  g_state_sender.fast_remaining = 10;
  g_state_sender.last_send_time = HAL_GetTick();
  DEBUG_SendString("[STATE] Fast mode reset (10 times)\r\n");
}

/**
  * @brief 状态发送机更新
  * @retval None
  * @details 快速模式发送10次(5s间隔)，之后切换到15s间隔
  */
void StateSender_Update(void)
{
  if(!g_state_sender.initialized)
  {
    return;
  }

  uint32_t now = HAL_GetTick();
  if(now - g_state_sender.last_send_time < g_state_sender.interval_ms)
  {
    return;
  }

  /* 触发一次发送 */
  if(g_state_sender.fast_remaining > 0)
  {
    (void)StateSender_SendFast();
  }
  else
  {
    (void)StateSender_SendNormal();
  }
  g_state_sender.send_state++;
  g_state_sender.last_send_time = now;

  /* 处理快速模式次数 */
  if(g_state_sender.fast_remaining > 0)
  {
    g_state_sender.fast_remaining--;
    if(g_state_sender.fast_remaining == 0)
    {
      g_state_sender.interval_ms = 15000;  /* 正常发送间隔 15s */
      DEBUG_SendString("[STATE] Switch to normal mode (15s)\r\n");
    }
  }
}

/**
  * @brief 快速发送函数
  * @retval 0: 成功, -1: 失败
  * @details 发送格式: dev_设备码P_平均P值R_平均R值S_状态
  */
int StateSender_SendFast(void)
{
  /* 雷达状态：缓冲/有人=1，无人=0 */
  Radar_TargetStatus_t status = StateSender_GetRadarStatus();
  uint8_t s_val = (status == RADAR_TARGET_NOBODY) ? 0 : 1;

  uint16_t valid_count = StateSender_GetRadarValidCount();
  uint32_t p_sum = StateSender_GetRadarPowerSum();
  uint32_t r_sum = StateSender_GetRadarRangeSum();

  uint32_t p_avg = 0;
  uint32_t r_avg = 0;
  if(s_val == 1 && valid_count > 0)
  {
    p_avg = p_sum / valid_count;
    r_avg = r_sum / valid_count;
  }

  char payload[64];
  snprintf(payload, sizeof(payload), "dev_%sP_%luR_%luS_%u", g_device_code, (unsigned long)p_avg, (unsigned long)r_avg, s_val);

  if(LORA_SendFormattedData(payload) == 0)
  {
    /* 发送完成后重置毫米波雷达累积值 */
    RADAR_ClearAccumulatedData();
    g_getdata_miss_count++;
    DEBUG_SendString("[STATE] Fast status sent\r\n");
    return 0;
  }

  DEBUG_SendString("[STATE] Fast status send failed\r\n");
  return -1;
}

/**
  * @brief 正常发送函数
  * @retval 0: 成功, -1: 失败
  * @details 发送格式: dev_设备码humi_湿度值temp_温度值P_平均P值R_平均R值S_状态
  */
int StateSender_SendNormal(void)
{
  float temp = 0.0f;
  float humi = 0.0f;
  (void)StateSender_GetTempHumi(&temp, &humi);

  /* 雷达状态：缓冲/有人=1，无人=0 */
  Radar_TargetStatus_t status = StateSender_GetRadarStatus();
  uint8_t s_val = (status == RADAR_TARGET_NOBODY) ? 0 : 1;

  uint16_t valid_count = StateSender_GetRadarValidCount();
  uint32_t p_sum = StateSender_GetRadarPowerSum();
  uint32_t r_sum = StateSender_GetRadarRangeSum();

  uint32_t p_avg = 0;
  uint32_t r_avg = 0;
  if(s_val == 1 && valid_count > 0)
  {
    p_avg = p_sum / valid_count;
    r_avg = r_sum / valid_count;
  }

  /* 温湿度保留2位小数，*100发送为整数（如 22.34 -> 2234） */
  int32_t humi100 = (int32_t)(humi * 100.0f + (humi >= 0 ? 0.5f : -0.5f));
  int32_t temp100 = (int32_t)(temp * 100.0f + (temp >= 0 ? 0.5f : -0.5f));

  char payload[96];
  snprintf(payload, sizeof(payload), "dev_%shumi_%ldtemp_%ldP_%luR_%luS_%u",
           g_device_code,
           (long)humi100, (long)temp100,
           (unsigned long)p_avg, (unsigned long)r_avg, s_val);

  if(LORA_SendFormattedData(payload) == 0)
  {
    /* 发送完成后重置毫米波雷达累积值 */
    RADAR_ClearAccumulatedData();
    g_getdata_miss_count++;
    DEBUG_SendString("[STATE] Normal status sent\r\n");
    return 0;
  }

  DEBUG_SendString("[STATE] Normal status send failed\r\n");
  return -1;
}

/**
  * @brief 获取毫米波雷达状态
  * @retval Radar_TargetStatus_t 雷达状态
  */
Radar_TargetStatus_t StateSender_GetRadarStatus(void)
{
  return RADAR_GetTargetStatus();
}

/**
  * @brief 获取P值总值
  * @retval P值累积总和
  */
uint32_t StateSender_GetRadarPowerSum(void)
{
  return Radar.target_info.power_sum;
}

/**
  * @brief 获取R值总值
  * @retval R值累积总和
  */
uint32_t StateSender_GetRadarRangeSum(void)
{
  return Radar.target_info.range_sum;
}

/**
  * @brief 获取有效次数
  * @retval 有效数据次数
  */
uint16_t StateSender_GetRadarValidCount(void)
{
  return Radar.target_info.valid_count;
}

/**
  * @brief 获取温湿度
  * @param temp: 温度输出指针
  * @param humi: 湿度输出指针
  * @retval 0: 成功, -1: 失败
  */
int StateSender_GetTempHumi(float *temp, float *humi)
{
  if(temp == NULL || humi == NULL)
  {
    return -1;
  }

