luckyCharm1123/STM32_LED/Core/Src/main.c
  return (SHT30_Soft_Read(temp, humi) == 0) ? 0 : -1;
}

/**
  * @brief 重新初始化LoRa并配置MAC/CHANNEL
  * @retval None
  */
void LORA_ReinitAndConfig(void)
{
  /* 进入AT模式需要前后静默窗口，这里在重初始化前保持2s静默 */
  DEBUG_SendString("[LORA] Starting reinitialization...\r\n");

  /* 清空LoRa接收缓冲区 */
  extern LORA_Status_t lora_status;
  lora_status.rx_length = 0;
  lora_status.data_ready = 0;
  memset(lora_status.rx_buffer, 0, LORA_RX_BUFFER_SIZE);

  /* 清空UART的错误标志和接收缓冲区 */
  __HAL_UART_CLEAR_OREFLAG(&huart2);
  __HAL_UART_CLEAR_FEFLAG(&huart2);
  __HAL_UART_CLEAR_NEFLAG(&huart2);
  __HAL_UART_CLEAR_IDLEFLAG(&huart2);

  /* 保持2秒静默,确保没有任何数据传输 */
  DEBUG_SendString("[LORA] Waiting 2s for silence...\r\n");
  HAL_Delay(2000);

  DEBUG_SendString("[LORA] Calling LORA_Init...\r\n");
  if(LORA_Init(9600) != 0)
  {
    DEBUG_SendString("[LORA] Reinit failed\r\n");
    return;
  }

  if(g_lora_configured)
  {
    if(LORA_ConfigureMacAndChannel(g_lora_mac, g_lora_channel) == 0)
    {
      DEBUG_SendString("[LORA] Re-configured MAC/CHANNEL successfully\r\n");
    }
    else
    {
      DEBUG_SendString("[LORA] Re-config MAC/CHANNEL failed\r\n");
    }
  }
}

/**
  * @brief 生成8位设备码
  * @param device_code: 存储8位设备码的缓冲区（至少9字节，包含结束符）
  * @retval None
  * @details 基于STM32唯一ID生成8位十六进制设备码
  *          取UID的前32位，转换为8位十六进制字符串
  *          这样每台设备都有唯一的设备标识
  */
void Generate_Device_Code(char *device_code)
{
  // STM32F103唯一ID地址：0x1FFFF7E8
  const uint32_t *uid_base = (const uint32_t *)0x1FFFF7E8U;

  // 读取第一个32位ID
  uint32_t uid_0 = uid_base[0];

  // 格式化为8位十六进制字符串
  sprintf(device_code, "%08" PRIX32, uid_0);
}

/**
  * @brief UART接收事件回调函数 (用于雷达DMA+空闲中断)
  * @param huart: UART句柄
  * @param Size: 当前DMA缓冲区中的数据量
  * @retval None
  * @details 当DMA接收完成或检测到空闲帧时调用此函数
  *          用于USART3的雷达数据接收
  */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
  // 检查是否是USART3的中断（雷达数据）
  if(huart->Instance == USART3)
  {
      // 调用雷达驱动的UART事件回调函数
      RADAR_UART_RxEventCallback(huart, Size);
  }
}

/**
  * @brief UART错误回调函数（雷达DMA接收恢复）
  * @param huart: UART句柄
  * @retval None
  * @details 处理USART3接收过程中的ORE/FE/NE/PE错误，清标志并重启DMA接收
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  if(huart->Instance == USART3)
  {
    static uint32_t last_err_log_time = 0;
    static uint32_t err_count = 0;
    uint32_t err = huart->ErrorCode;

    /* 清除常见错误标志 */
    __HAL_UART_CLEAR_OREFLAG(huart);
    __HAL_UART_CLEAR_FEFLAG(huart);
    __HAL_UART_CLEAR_NEFLAG(huart);
    __HAL_UART_CLEAR_PEFLAG(huart);

    /* 终止当前接收并重启DMA空闲接收 */
    (void)HAL_UART_AbortReceive(huart);
    if(HAL_UARTEx_ReceiveToIdle_DMA(huart, Radar.rx_buffer, sizeof(Radar.rx_buffer)) == HAL_OK)
    {
      Radar.old_pos = 0;
      Radar.accum_len = 0;
      Radar.frame_ready = 0;
      Radar.state = RADAR_STATE_OK;
      uint32_t now = HAL_GetTick();
      if(now - last_err_log_time >= 1000)
      {
        char err_msg[128];
        err_count++;
        snprintf(err_msg, sizeof(err_msg), "[RADAR] UART error recovered, RX restarted (err=0x%08lX cnt=%lu)\r\n",
                 (unsigned long)err, (unsigned long)err_count);
        DEBUG_SendString(err_msg);
        last_err_log_time = now;
      }
    }
    else
    {
      Radar.state = RADAR_STATE_ERROR;
      uint32_t now = HAL_GetTick();
      if(now - last_err_log_time >= 1000)
      {
        char err_msg[128];
        err_count++;
        snprintf(err_msg, sizeof(err_msg), "[RADAR] UART error recovery failed (err=0x%08lX cnt=%lu)\r\n",
                 (unsigned long)err, (unsigned long)err_count);
        DEBUG_SendString(err_msg);
        last_err_log_time = now;
      }
    }
  }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence. 此函数在发生错误时执行
  * @details 当程序遇到严重错误时调用此函数
  *          典型错误场景：
  *          - 时钟配置失败
  *          - 外设初始化失败
  *          - 硬件故障
  *          - 软件异常
  * @retval None 无返回值
  * @note 此函数不会返回，程序在此处阻塞
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* 用户代码开始：错误处理调试 */

  /* 标准错误处理实现 */
  __disable_irq();  // 禁用所有中断
  /*
   * __disable_irq()说明：
   * - 关闭全局中断使能
   * - 防止在错误状态下执行中断服务程序
   * - 提高系统安全性
   */

  /* 错误状态指示：死循环 */
  while (1)
  {
    /* 程序在此处阻塞，可以通过调试器查看错误原因 */
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  *         报告发生assert_param错误的源文件名和源行号
  * @details 这是断言失败时的回调函数
  *          用于调试和开发阶段检测参数错误
  *          当HAL库中的assert_param宏检测到无效参数时调用此函数
  * @param  file: pointer to the source file name 源文件名指针
  * @param  line: assert_param error line source number 断言参数错误的行号
  * @retval None 无返回值
  * @note 此函数仅在调试版本中有效（定义了USE_FULL_ASSERT宏）
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* 用户代码开始：第6区 */
  /* 可以在此处添加断言失败的处理代码 */
  /* 典型实现：
   * printf("Assert failed: %s, line %lu\n", file, line);
   * 或者通过串口发送错误信息
   * 或者在调试器中设置断点
   */

  /* 无限循环，便于调试时定位问题 */
  while (1)
  {
  }
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
